<template>
  <div class="HelpView">
    <div class="title">宠物主人常见问题</div>
    <h4>什么是puphub？</h4>
    <div class="subhead">了解更多我们对动物的关爱和 <a href="/about">我们的故事</a></div>
    <el-collapse>
      <el-collapse-item v-for="(item,index) in contentList"
                        :key="index"
                        :title="item.title"
                        :name="index">
        <div v-html="item.content"></div>
      </el-collapse-item>
    </el-collapse>
  </div>
</template>

<script>
export default {
  data() {
    return {
      contentList: [
        {
          title: "如何预定宠物服务？",
          content:
            "注册或登陆并填写关于您和您的宠物的所有信息，我们有了这些信息才能进一步处理您的预定请求。一旦您完成这个过程，您可以查看你附近可提供服务的宠物保姆以及他们的服务日期，您可以和他们聊天，查看他们的可服务时间以及商谈服务事项。点击这里 <a href='/services'>开始您的预定</a> 。<br><br>由于安全原因，一旦他们确认为您的预定服务提供帮助，请只提供您的微信或者其他联系资料给宠物保姆。另外，保留所有聊天通话记录。",
        },
        {
          title: "你否能帮忙跨国托运宠物或仅在国内托运？",
          content:
            "目前，我们不提供宠物托运服务，但是我们能推荐一些很不错的公司帮您。更多信息请发邮件到 info@puphub.com.cn ，我们很乐意提供给你一些推荐。",
        },
        {
          title: "你能提供哪些服务?",
          content:
            "了解更多我们的服务列表，价格和 <a href='/services'>我们的长期优惠</a> 。",
        },
        {
          title: "使用宠物服务的优势有哪些？",
          content:
            "选择宠物服务时，不同的服务类型，具有不一样服务优势：<br><br><a href='/services'>遛狗</a> 或者 <a href='/services'>上门查看服务</a> 是在你没有时间或者只想让其他人上门并确保您的宠物一切正常的一项很不错的服务。所有PH服务都有图片 & 视频动态发送，让您知道您的宠物被关爱照顾以及和宠物保姆大量的逗玩时间，从而让您放心。<br><br><a href='/services'>狗狗寄养</a> （您的宠物去呆到经验丰富的宠物保姆家）：您的宠物将住在一个我们的值得信赖的宠物保姆家里，宠物保姆会投入他/她的时间专注于您的宠物。我们提供两种寄养类型：<br><br>- 单独寄样 - 您的宠物将是唯一寄养在宠物保姆家的宠物。<br><br>- 群体寄养 - 您的狗狗会和其他客户的狗狗寄养在一起，或者如果宠物保姆有他们自己的狗狗也会寄养在一起。这是帮助宠物社交互动，让他们和其他毛茸茸的伙伴玩耍的好办法。我们的宠物保姆痴迷于有更多时间去宠物陪伴，同时您的狗狗也会得到不限的陪玩时间。这适用于狗狗、小兔子、仓鼠和更多宠物！<br><br>* 如果你需要预定群体寄养， 强烈推荐在此之前进行见面了解。<br><br><a href='/services'>上门住家托管</a> ：（有经验的宠物保姆上门住在您家里并照顾您的宠物）您的宠物由专业的并具有保障的宠物保姆照料的同时，还能呆在熟悉的环境中。除了能呆在他们自己舒适的家中并保持他们的生活习惯不会被扰乱的同时，您的宠物也能得到更多的关爱和关注。所有这些价格都已包含附加服务，宠物保姆同时会看管您的家，如果您的家里或您的宠物出现麻烦会告知你，也能帮你收信和给植物浇水。",
        },
        {
          title: "您是否在我预订时收取一只以外的宠物费用？",
          content:
            "是的，根据动物数量的不同，费用和价格会相应的收取。<br><br>对于一只以外的的每只狗狗，将收取额外的20元人民币单次遛狗的费用，如果上门住家托管服务，则收取每天20元人民币的费用。<br><br>这仅适用于所有家中的狗狗都必须属于同一宠物主人。如果是和其他狗狗一起群体寄养，则适用标准的群体寄养费率。<br><br>在每次预定中对于单只以外的猫咪、仓鼠或其他小型的毛茸茸动物朋友，我们不收取额外的费用。",
        },
        {
          title: "有没有可以提供宠物药物治疗或特殊护理的宠物保姆？",
          content:
            "有。所有的PH宠物保姆在他们的宠物保姆个人主页上都有他们能提供的服务详细介绍。",
        },
        {
          title: "我的宠物需要注册登记和挂牌吗？",
          content:
            "需要，我们要求所有的宠物主人根据当地法律办理养犬登记，并必须在宠物的项圈上挂带有您的全名和联系电话的标识牌（最好是中英双语）。同时请确保将您的养犬登记证交给宠物保姆。",
        },
        {
          title: "我的宠物需要具备哪些疫苗接种，虱子或跳蚤驱虫治疗？",
          content:
            "如果您打算群体寄养到宠物保姆家，请询问宠物保姆他们对于疫苗接种的要求。请确保您的宠物已经注射完所有的法律要求的疫苗，并在您预定的服务期间将您的宠物的疫苗接种本交给宠物保姆。宠物保姆同时会告知您是否要求您的宠物具备预防性的虱子或跳蚤驱虫治疗。<br><br>如果宠物保姆他们自己的宠物会接触您的宠物，务必询问宠物保姆，他们的宠物接种了哪些疫苗或者没有接种。",
        },
        {
          title: "我之前从未离开过我的宠物，为什么我要相信PH？",
          content:
            "PH是由宠物爱好者创建面向宠物爱好者平台。所有在PH的宠物保姆都会乐于接待他人的动物。我们全部的宠物保姆都经过严格的面试过程，面试期间我们筛选过滤并逐个精选宠物保姆，以确保您的宠物会得到很好的照顾。比起呆在宠物托管所，您的毛茸茸伙伴和我们热爱动物的宠物保姆呆在一起会更加开心。",
        },
        {
          title: "您怎么选择加入到你们团队的宠物保姆？",
          content:
            "PH宠物保姆在进入我们团队前，接受了严格的审查并通过了面对面的审核。他们都饲养过、寄养过、看护过宠物并具有宠物经验。通过把我们的宠物带进面试环节，我们确保他们都是真正的动物爱好者。在宠物保姆可以正式接受预定前，我们同时会登记他们的护照。宠物保姆服务期间，如果你需要宠物保姆的护照复件，请联系我们，我们将征询宠物保姆的同意然后分享。",
        },
        {
          title: "为什么我应选择PH宠物保姆而不是我的朋友或家人？",
          content:
            "雇用一个宠物保姆可能会比让您的让邻居或亲戚帮忙花更多钱，但是通过付费给有合适经验和培训经历的人去做专业的事情才是长久的打算，甚至可以挽救宠物的生命。<br><br>PH以帮助宠物和宠物主人为创立目标，为宠物主人提供无忧服务的同时，为宠物带来高标准的安全服务。",
        },
        {
          title: "我能和托管我的宠物的宠物保姆或其家庭成员见面吗？",
          content:
            "可以，在服务开始前，我们鼓励所有的宠物主人和宠物保姆都进行见面了解 。一旦宠物保姆确认有时间提供您预定的服务，您可以使用我们的聊天工具商定见面了解活动。如果是群体寄养，尽可能先在外面见面，因为有时候宠物保姆的宠物会保护自己的领地。",
        },
        {
          title: "见面了解是如何进行的？",
          content:
            "如果您的宠物将寄养在宠物保姆家里，我们推荐最好在宠物保姆家里进行见面了解，那样在你不在期间，您可以了解宠物生活的环境。在此期间，您需要确保宠物保姆家庭的舒适性以及确保可以满足您的宠物的需求。<br><br>比如：如果你有一只不适宜爬楼梯的年老狗狗，我们建议您挑选有电梯的宠物保姆家。<br><br>如果你预定上门住家托管、上门查看或上门遛狗服务，宠物保姆会去您家照顾您的宠物。",
        },
        {
          title: "如果宠物保姆取消了我的预定怎么办？",
          content:
            "如果因为无法控制的情况，比如生病或者家庭出现紧急情况，宠物保姆不得不取消您已支付的预定。请直接在支持页面联系我们，我们会协助您找到一个替代的宠物保姆。<br><br>如果您不接受这样的安排，您有权取消预定，我们会在3-5个服务日处理您的退款。",
        },
        {
          title: "我能直接雇用宠物保姆吗？",
          content:
            "我们要求所有的服务预定都要通过PH平台进行，以保障交易双方和宠物的权益。平台之外发生的服务预定不被PH保险或紧急处理机制保障。我们不负责没有通过 puphub.com.cn网站完成和支付的服务预定。",
        },
        {
          title: "我的信息在PH平台上保密吗？",
          content:
            "绝对保密。我们不会给任何第三方泄露任何客户信息。只有宠物主人和/或指定的宠物保姆可以获得您的个人信息，例如名字、电话和地址。",
        },
        {
          title: "我通过特殊饮食喂养我的宠物，您能提供吗？",
          content:
            "我们尽最大努力满足您还有您的宠物的需求。改变饮食是不安全的，所以我们希望保持宠物的日常习惯和饮食习惯。在宠物保姆照顾宠物期间，所有的宠物主人都要负责提供宠物食物。",
        },
        {
          title: "我不在家时，如果我的财产受损或我的宠物受伤怎么办？",
          content:
            "我们的宠物保姆都同意按照宠物保姆协议的约定，提供可靠的、关怀的和可信赖的服务。然而，我们的宠物保姆只因自己的疏漏或者刻意的不良行为而赔偿。由于动物具有极端的不可预测性，我们不接受赔偿不寻常的意外损失（比如由宠物引起的或不是宠物引起的家具啃咬损坏、溅撒、宠物污渍、水渍等）。更多信息，查看我们的使用条款与条件 。<br><br>如果您的宠物可以自由到外面去，我们不负责因此可能造成的人身伤害、宠物丢失、罚款等问题。请确保您的每只宠物的项圈都挂有具备中英双语的地址和电话信息的标识牌。",
        },
        {
          title: "宠物保姆知道最近的兽医诊所吗？他们有宠物保险吗？",
          content:
            "在服务开始之前的见面了解活动中，我们的宠物保姆应该已经索要了您的紧急联系信息和宠物保险信息。",
        },
        {
          title: "服务期间，我的宠物逃跑了怎么办？",
          content: "我们的保姆有一个准备好的应急计划。你可以参考该 计划。",
        },
        {
          title: "服务期间，我的宠物受伤或生病了怎么办？",
          content:
            "因为我们全部的宠物保姆都经过严格的面试过程，发生紧急事故的可能极小。万一发生紧急情况，宠物保姆必须直接电话联系宠物主人，让宠物主人决定去最近的兽医诊所还是去指定的兽医诊所。我们明确推荐申普给所有的宠物保姆，因为申普24/7营业。万一发生紧急情况，查看我们的指南。",
        },
        {
          title: "发生紧急情况期间，宠物保姆联系不到我怎么办？",
          content:
            "这也是为什么让你在PH账户中提供紧急联系人的重要原因。当你不在期间，如果宠物年老生病需要药物治疗，为了安全考虑，请提前和您的朋友、家人或可提供服务的兽医一起准备一个应急计划，并告知宠物保姆该应急计划。",
        },
        {
          title: "如果我对PH服务体验不满意怎么办？",
          content:
            "如果您对服务体验不满意，请联系我们并让我们知道原因。我们一直需要意见反馈，和提高我们PH服务的办法。如果您在72小时内投诉我们的服务，并已经在服务开始前进行了见面了解 ，而且在服务结束后给了宠物保姆差评，你将得到全额退款。关于我们退款政策的更多信息，访问条款与条件。",
        },
      ],
    };
  },
};
</script>

<style scoped>
a {
  text-decoration: underline;
}

.HelpView {
  width: 1190px;
  margin: 0 auto;
  margin-top: 50px;
}

.title {
  font-size: 2em;
  font-weight: bold;
  margin: 1rem 0;
}
.subhead {
  margin: 1rem 0;
  font-size: 1rem;
  line-height: 1.5;
}

::v-deep .el-collapse-item__header {
  margin-top: 5px;
  background-color: #124c5f;
  color: #fff;
  font-size: 1.25rem;
  border-radius: 5px 5px 0 0;
  border: 1px solid #fff;
  padding: 5px 20px 5px;
}

::v-deep .el-collapse-item__content {
  border: 1px solid #cdcdcd;
  background: #f9f7f6;
  border-radius: 0 0 5px 5px;
  padding: 1rem;
  color: #666666;
  line-height: 1.5;
  max-height: 100vh;
  font-size: 1rem;
}

::v-deep .el-collapse-item__content a {
  text-decoration: underline;
}
</style>